app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # binding.pry
    # @students = Student.all
    @student = Student.find_by_id(params[:id])